{
  "backend/main.mo": "Main Motoko actor defining data types and CRUD operations for scores, preset songs, custom audio samples, fingering maps, and ocarina profiles, with a base64-encoded creator password hash for access control.",
  "feature_evidence.json": "Feature evidence report mapping implemented feature IDs and titles to their relevant source files, component dependencies, test IDs, and confidence levels for three ocarina-related features.",
  "frontend-file-summaries.txt": "JSON dictionary providing one-sentence descriptions of each frontend source file, serving as a reference summary of component responsibilities and hook behaviors.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property design tokens for light and dark themes including colors, radius, chart palette, and sidebar variables.",
  "frontend/index.html": "Minimal HTML shell for the Ocarina Music App that mounts the React app into a root div and loads the main TypeScript entry point as an ES module.",
  "frontend/src/App.tsx": "Root React component that composes all application panels (OcarinaShowcasePanel, PianoKeyboard, OcarinaVisual, SheetMusic, NoteEditor, PlaybackControls, etc.) and wires together score editing, playback, fingering, and profile image loading state.",
  "frontend/src/components/CreatorPasswordDialog.tsx": "Modal dialog component that prompts for a creator password, encodes it with btoa before passing to the parent callback, and displays validation and loading states without ever storing plain text.",
  "frontend/src/components/FingeringSettingsPanel.tsx": "A React panel component for managing ocarina fingering maps, allowing users to toggle hole positions per note, save configurations to the backend, and reset to defaults, with status indicators for loading/saving/dirty states.",
  "frontend/src/components/ImageRecognitionPanel.tsx": "A React panel that lets users upload a sheet music image, run AI recognition to extract notes, review/edit the recognized notes with tablature diagrams, and load them into the score editor.",
  "frontend/src/components/NoteEditor.tsx": "A React component for editing a selected score note's pitch, duration, and lyrics, with a tablature diagram preview and a delete button.",
  "frontend/src/components/OcarinaProfileCard.tsx": "A card component displaying an ocarina profile's image, name, description, and size/pitch badge, with optional edit/delete action buttons and a play button.",
  "frontend/src/components/OcarinaProfileForm.tsx": "A dialog form for creating or editing ocarina profiles, supporting single and bulk image uploads, size selection, and creator password authentication before saving via React Query mutations.",
  "frontend/src/components/OcarinaShowcasePanel.tsx": "A collapsible panel that displays a horizontally scrolling (with auto-scroll) showcase of ocarina profile cards, supporting add, edit, and password-protected delete operations.",
  "frontend/src/components/OcarinaVisual.tsx": "Renders an interactive ocarina visual with draggable/resizable finger holes overlaid on a custom or external image, highlighting active holes based on the current note's fingering map.",
  "frontend/src/components/PianoKeyboard.tsx": "Displays a diatonic piano keyboard (C5–C6) that plays notes via mouse clicks or keyboard shortcuts, with visual active-note highlighting and optional custom audio samples.",
  "frontend/src/components/PlaybackControls.tsx": "Provides transport controls (play, pause, stop, repeat), tempo slider, score naming, and save/load actions for the score editor's playback state.",
  "frontend/src/components/PresetSongLibrary.tsx": "Lists preset folk songs fetched from the backend (seeding missing ones on mount) and allows loading them into the score editor.",
  "frontend/src/components/SampleUploadPanel.tsx": "Renders a per-note panel for uploading, previewing, and deleting custom audio samples for each diatonic note, with upload progress tracking.",
  "frontend/src/components/ScoreLoadDialog.tsx": "Modal dialog that lists all saved scores from the backend, allowing the user to load a score into the editor or delete it.",
  "frontend/src/components/SheetMusic.tsx": "React SVG component that renders a multi-row sheet music staff with notes, treble clef, fingering diagrams, and playback/selection highlighting. Supports custom fingering maps and auto-scrolls to the currently playing note.",
  "frontend/src/components/TablatureDiagram.tsx": "React SVG component that renders a 2x2 ocarina hole fingering diagram in small, medium, or large sizes, with filled/unfilled holes based on a Fingering array or custom FingeringMap.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useAudioPlayback.ts": "Custom hook providing ocarina-like audio synthesis via the Web Audio API with harmonics and vibrato, plus support for playing custom audio sample URLs and stopping all active nodes.",
  "frontend/src/hooks/useFingeringMap.ts": "Custom hook managing a per-note ocarina fingering map with toggle, reset, and backend save/load functionality, hydrating from the backend once on mount and tracking dirty state.",
  "frontend/src/hooks/useImageRecognition.ts": "Custom hook that analyzes an uploaded image file using canvas pixel data to detect staff lines and noteheads, mapping them to diatonic pitches and durations, with a demo fallback if detection fails.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status to child components.",
  "frontend/src/hooks/usePlayback.ts": "React hook managing audio playback state (play, pause, stop, repeat) for a sequence of ScoreNotes, with tempo control and async note-by-note scheduling via useAudioPlayback.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for CRUD operations on scores, sample assignments, preset songs, fingering maps, and ocarina profiles via a backend actor.",
  "frontend/src/hooks/useScoreEditor.ts": "React hook encapsulating score editing state and actions (add, delete, update, insert, load, clear notes) along with duration options and diatonic note constants.",
  "frontend/src/index.css": "Global stylesheet importing Google Fonts and Tailwind, defining CSS custom properties for a warm earthy light/dark color palette, and utility classes for parchment backgrounds, staff lines, and piano key styles.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/fingeringMap.ts": "Defines the 4-hole ocarina fingering map, note frequencies, staff positions, note labels, and keyboard shortcuts for the diatonic C5–C6 scale.",
  "frontend/src/utils/presetSongs.ts": "Contains hardcoded note sequences for preset songs (Scarborough Fair, Greensleeves, Amazing Grace, Danny Boy, Ode to Joy, etc.) using a helper to construct Note objects with pitch and duration.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom fonts (Playfair Display, Lato), an earthy color palette using oklch variables, custom shadows, border radii, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document (version 11) describing the Ocarina music app's architecture, existing features, known issues, and planned work, including piano keyboard UI, SVG ocarina visual, sheet music editor, playback, sound upload, image recognition, and Ocarina Profile system."
}