{
  "backend/main.mo": "Main Motoko actor for the Ocarina Music App that manages scores, preset songs, custom audio samples, and fingering maps using persistent Maps, exposing CRUD query/update methods for each.",
  "backend/migration.mo": "Migration module that upgrades the actor state by adding a default fingeringMap (8 notes with boolean hole arrays) to the existing scores, presetSongs, and customSamples state.",
  "feature_evidence.json": "Feature evidence report linking two implemented features—backend-persisted fingering map loading/saving in useFingeringMap and the Global Controls UI in FingeringSettingsPanel—to their test IDs and affected files.",
  "frontend-file-summaries.txt": "JSON document providing one-sentence summaries of each frontend source file, serving as a reference index for the project's component and hook structure.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for the light and dark color themes used throughout the application.",
  "frontend/index.html": "Minimal HTML shell that mounts the React app into a root div and loads the main TypeScript entry point as an ES module.",
  "frontend/src/App.tsx": "Root React component that wires together all panels and hooks (score editor, playback, fingering map) with shared state, rendering the full tabbed UI including the FingeringSettingsPanel.",
  "frontend/src/components/FingeringSettingsPanel.tsx": "Fingering settings panel component with a Global Controls section (Save button, loading spinner, saved/unsaved status indicator, toast notifications) above the existing per-note hole toggle grid and Reset button.",
  "frontend/src/components/ImageRecognitionPanel.tsx": "A React panel component that allows users to upload a sheet music image, run AI recognition on it to extract notes, review/edit the recognized notes with pitch/duration selectors and tablature diagrams, and load them into the score editor.",
  "frontend/src/components/NoteEditor.tsx": "A React component for editing a single selected score note, providing controls to change pitch, duration, and lyrics, display a tablature fingering diagram, and delete the note.",
  "frontend/src/components/OcarinaVisual.tsx": "An SVG-based React component that renders an illustrated ocarina with hand/finger overlays, visually highlighting which of the four tone holes are covered based on the current note being played.",
  "frontend/src/components/PianoKeyboard.tsx": "A React piano keyboard component rendering diatonic note keys (C5–C6) that can be clicked or triggered via keyboard shortcuts, playing audio samples and reporting the active note to the parent.",
  "frontend/src/components/PlaybackControls.tsx": "A React component providing transport controls (play, pause, stop, repeat), a tempo slider, an editable score name, and save/load buttons for managing score playback and persistence.",
  "frontend/src/components/PresetSongLibrary.tsx": "A React component that fetches and displays a list of preset folk songs from the backend (seeding missing ones from local data), allowing users to load any song into the score editor.",
  "frontend/src/components/SampleUploadPanel.tsx": "React panel component that lets users upload custom audio samples (WAV/MP3) per diatonic note, showing upload progress, status, and delete controls, while syncing sample URLs to a parent component.",
  "frontend/src/components/ScoreLoadDialog.tsx": "Modal dialog that lists all saved scores fetched from the backend, allowing users to load a score into the editor or delete it.",
  "frontend/src/components/SheetMusic.tsx": "SVG-based sheet music renderer that displays notes in multi-row staff layout with treble clef, note selection, playback highlighting, and fingering diagrams.",
  "frontend/src/components/TablatureDiagram.tsx": "SVG component that renders a small ocarina fingering diagram showing a 2x2 grid of holes filled or empty based on a Fingering array, with configurable sizes.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using the current Internet Identity, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useAudioPlayback.ts": "Custom hook providing Web Audio API-based ocarina note playback, supporting both synthesized flute-like tones and custom audio sample URLs, with stop-all functionality.",
  "frontend/src/hooks/useFingeringMap.ts": "Custom hook managing a per-note ocarina fingering map with local state, backend hydration, hole toggling, reset to defaults, and save/load via React Query mutations.",
  "frontend/src/hooks/useImageRecognition.ts": "A React hook that processes an uploaded image file to extract musical notes via canvas-based pixel analysis, detecting staff lines and noteheads to produce a RecognitionResult with ScoreNote arrays and confidence scores.",
  "frontend/src/hooks/useInternetIdentity.ts": "A React context provider and hook that manages Internet Identity authentication using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status.",
  "frontend/src/hooks/usePlayback.ts": "A React hook that controls sequential audio playback of ScoreNote arrays, supporting play, pause, resume, stop, repeat, and tempo adjustment via the useAudioPlayback hook.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations on scores, sample assignments, preset songs, and fingering maps by calling backend actor methods.",
  "frontend/src/hooks/useScoreEditor.ts": "A React hook providing state and actions for editing a list of ScoreNotes, including add, delete, update, insert, select, load, and clear operations along with duration options.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, configures Tailwind CSS, and defines a warm earthy OKLCH-based design token palette for both light and dark modes along with custom utility classes.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider for data fetching and InternetIdentityProvider for ICP authentication.",
  "frontend/src/utils/fingeringMap.ts": "Defines the 4-hole ocarina fingering map for the C5-C6 diatonic scale, including hole states, note frequencies, staff positions, note labels, and keyboard shortcuts.",
  "frontend/src/utils/presetSongs.ts": "Defines preset folk song data (Scarborough Fair, Greensleeves, Amazing Grace, Danny Boy, Ode to Joy) as arrays of Note objects with pitch and duration values for use in the ocarina app.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom earthy color palette (cream, parchment, terracotta, forest-green), typography/container-query/animate plugins, and design tokens for borders, shadows, and fonts.",
  "project_state.json": "Project state metadata describing the ocarina music app's architecture, existing features (piano keyboard, SVG ocarina visual, sheet music editor, playback, image recognition), and known issues at schema version 7."
}