{
  "backend/main.mo": "Motoko actor defining the backend for an ocarina music app, with persistent storage and CRUD operations for scores, preset songs, custom audio samples, and fingering maps.",
  "feature_evidence.json": "Feature evidence report mapping implemented feature IDs (custom image upload, draggable/resizable tone hole overlays, persistent hole positions, etc.) to their source files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON dictionary providing one-line summaries of each frontend source file, serving as a quick reference for the purpose and recent changes of each component, hook, and utility.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property design tokens for light and dark themes including colors, radius, and sidebar variables.",
  "frontend/index.html": "Minimal HTML shell for the React SPA, mounting the app into a root div and loading the main TypeScript entry point as an ES module.",
  "frontend/src/App.tsx": "Root React component that composes all panels and shared state (score editor, playback, fingering map, custom samples) and renders the full tabbed UI with header banner, piano keyboard, ocarina visual, sheet music, and settings panels.",
  "frontend/src/components/FingeringSettingsPanel.tsx": "Fingering settings panel with a Global Controls section (save button, loading/dirty/error status indicators, toast notifications) and a per-note hole toggle grid with a reset button.",
  "frontend/src/components/ImageRecognitionPanel.tsx": "A React panel component that allows users to upload a sheet music image, run AI recognition on it to extract notes, review/edit the recognized notes with pitch/duration selectors and tablature diagrams, and load them into the score editor.",
  "frontend/src/components/NoteEditor.tsx": "A React component for editing a single selected score note, providing controls for pitch, duration, and lyrics along with a tablature fingering diagram preview and a delete button.",
  "frontend/src/components/OcarinaVisual.tsx": "An interactive ocarina visualization component that displays finger hole states for the current note, supports uploading a custom instrument image, and allows drag-to-move and resize of hole overlays in an edit mode.",
  "frontend/src/components/PianoKeyboard.tsx": "A piano keyboard UI component that renders diatonic note keys, plays audio on click or keyboard shortcut press, and highlights the currently active note.",
  "frontend/src/components/PlaybackControls.tsx": "A transport controls component providing play/pause/stop, repeat toggle, tempo slider, score naming, and save/load actions for the score editor's playback state.",
  "frontend/src/components/PresetSongLibrary.tsx": "A component that displays a scrollable list of preset folk songs fetched from the backend (seeding missing ones from local data), allowing users to load any song into the score editor.",
  "frontend/src/components/SampleUploadPanel.tsx": "React panel component that lets users upload custom audio samples (WAV/MP3) per diatonic note, showing upload progress and allowing deletion, with state synced to a backend via React Query hooks.",
  "frontend/src/components/ScoreLoadDialog.tsx": "Modal dialog for loading or deleting previously saved scores from the backend, converting stored note data into ScoreNote objects and passing them to the parent via a callback.",
  "frontend/src/components/SheetMusic.tsx": "SVG-based sheet music renderer that displays notes in multi-row staff layout with treble clef, supporting note selection, playback highlighting, and custom fingering maps.",
  "frontend/src/components/TablatureDiagram.tsx": "SVG component that renders a 4-hole ocarina fingering diagram as a 2x2 grid of circles, with filled/unfilled holes based on a Fingering array, supporting multiple sizes and an optional custom fingering map.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using the current Internet Identity, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useAudioPlayback.ts": "Custom hook providing Web Audio API-based ocarina note playback, synthesizing a flute-like tone with harmonics and vibrato or playing a custom audio sample from a URL.",
  "frontend/src/hooks/useFingeringMap.ts": "Custom hook managing a per-note 4-hole fingering map with local state, backend hydration, hole toggling, reset to defaults, and save functionality via React Query mutations.",
  "frontend/src/hooks/useImageRecognition.ts": "A React hook that processes an uploaded image file to extract musical notes via canvas-based pixel analysis, detecting staff lines and noteheads to produce a ScoreNote array with a confidence score.",
  "frontend/src/hooks/useInternetIdentity.ts": "A React context provider and hook that manages Internet Identity authentication using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status.",
  "frontend/src/hooks/usePlayback.ts": "A React hook that controls sequential audio playback of ScoreNote arrays, supporting play, pause, resume, stop, repeat, and tempo adjustment via the useAudioPlayback hook.",
  "frontend/src/hooks/useQueries.ts": "Defines TanStack Query hooks for all backend actor operations including CRUD for scores, sample assignments, preset songs, and the fingering map.",
  "frontend/src/hooks/useScoreEditor.ts": "A React hook that manages the state and actions for a score editor, including adding, deleting, updating, inserting, selecting, and loading ScoreNote entries along with a score name.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, configures Tailwind CSS, and defines a warm earthy OKLCH-based design token palette for both light and dark modes along with custom utility classes.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/fingeringMap.ts": "Defines the 4-hole ocarina fingering map for the C5-C6 diatonic scale, along with note frequencies, labels, staff positions, and keyboard shortcuts.",
  "frontend/src/utils/presetSongs.ts": "Contains pre-built Note arrays for several folk songs (Scarborough Fair, Greensleeves, Amazing Grace, Danny Boy, Ode to Joy) with timing constants for common note durations.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom earthy color palette, typography/container-queries/animate plugins, custom fonts, shadows, and design token mappings using oklch colors.",
  "project_state.json": "Project state manifest describing the ocarina music app's architecture, existing features, and known issues at schema version 1.0.0 / project state version 9."
}