{
  "kind": "build_request",
  "title": "Persist fingering map to backend and extend Fingering Settings panel with global controls",
  "projectName": "Ocarina Composer",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-13",
      "text": "Add a backend endpoint to save and load the full fingering map for all 8 diatonic notes (C5–C6). Each entry maps a note name to a 4-element array of booleans (open/closed holes). Expose an update method `saveFingeringMap` that accepts the full map and a query method `loadFingeringMap` that returns the stored map, persisting data in stable storage.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "a way to save the fingering map for all 8 notes to the backend, so it displays the configured ocarina tablature all the time"
        ]
      },
      "acceptanceCriteria": [
        "A `saveFingeringMap` update method accepts the full 8-note fingering map and stores it in stable backend storage.",
        "A `loadFingeringMap` query method returns the previously saved fingering map, or the default map if none has been saved.",
        "The map persists across canister upgrades via stable variables."
      ]
    },
    {
      "id": "REQ-14",
      "text": "Extend the `useFingeringMap` hook to support loading the persisted fingering map from the backend on app startup and saving the current in-memory fingering map to the backend on demand. On mount, call `loadFingeringMap` and override the local state with the retrieved map. Expose a `saveToBackend` function that calls `saveFingeringMap` with the current map.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "so it displays the configured ocarina tablature all the time",
          "a way to save the fingering map for all 8 notes to the backend"
        ]
      },
      "acceptanceCriteria": [
        "On app startup, the hook calls `loadFingeringMap` and hydrates the local fingering map with the backend response.",
        "The hook exposes a `saveToBackend` async function that calls the backend `saveFingeringMap` with the current full map.",
        "If no saved map exists on the backend, the hook falls back to the built-in defaults from `fingeringMap.ts`.",
        "Loading state and error state are handled gracefully (no crash if backend is unavailable)."
      ]
    },
    {
      "id": "REQ-15",
      "text": "Extend the existing `FingeringSettingsPanel.tsx` by adding a 'Global Controls' section at the top of the panel. This section must contain a 'Save Fingering Map' button that persists the current fingering map for all 8 notes to the backend via the `saveToBackend` function from `useFingeringMap`, and a status indicator (e.g., 'Saved' or 'Unsaved changes') reflecting whether the current in-memory map matches the last saved backend state. The existing per-note hole toggle grid and Reset to Defaults button remain unchanged below the global controls section.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "it replace/extend that existing panel with a global controls, section at the top"
        ]
      },
      "acceptanceCriteria": [
        "A clearly labeled 'Global Controls' section appears at the top of the Fingering Settings panel.",
        "A 'Save Fingering Map' button calls `saveToBackend` and shows a success or error toast/notification on completion.",
        "A status indicator displays whether there are unsaved changes compared to the last successfully saved backend state.",
        "The existing per-note fingering toggles and Reset to Defaults button remain fully functional below the global controls section.",
        "The panel's visual style matches the existing warm earthy theme."
      ]
    }
  ],
  "constraints": [
    "Do not modify files in frontend/src/hooks/useActor.ts, frontend/src/hooks/useInternetIdentity.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
    "The existing per-note fingering toggle UI and Reset to Defaults button in FingeringSettingsPanel.tsx must remain intact.",
    "Backend changes must use stable variables so the fingering map survives canister upgrades."
  ],
  "nonGoals": [
    "Do not change the fingering map data structure or the default values defined in fingeringMap.ts.",
    "Do not add per-user or multi-profile fingering map storage — a single global map is sufficient.",
    "Do not alter the OcarinaVisual, SheetMusic, or TablatureDiagram components directly; they already consume the fingering map from the hook."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}